## Credits.csv 
Cast.csv and Crew.csv table are extracted from the credits.csv file

In [1]:
import pandas as pd
import ast
import numpy as np
import datetime

In [2]:
credits_df = pd.read_csv('credits.csv')
cast_df = credits_df[['cast','id']]

In [3]:
# Convert the 'cast' column to list of dictionaries using ast.literal_eval
cast_df['cast'] = cast_df['cast'].apply(ast.literal_eval)

ids = list(cast_df['id'])
dfs = []

# Iterate over each movie and assign the corresponding foreign key to the entries
for movie_id, entries in zip(ids, cast_df['cast']):
    for entry in entries:
        entry['movie_id'] = movie_id

    # Convert data to DataFrame and append it to the list
    df = pd.DataFrame(entries)
    dfs.append(df)

# Concatenate all DataFrames into a single DataFrame
cast_dfs = pd.concat(dfs, ignore_index=True)
cast_dfs.to_csv('cast.csv', index = False)

C:\Users\sambo\AppData\Local\Temp\ipykernel_15088\1702861963.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cast_df['cast'] = cast_df['cast'].apply(ast.literal_eval)

In [4]:
credits_df = pd.read_csv('credits.csv')
crew_df = credits_df[['crew','id']]

In [5]:
# Convert the 'cast' column to list of dictionaries using ast.literal_eval
crew_df['crew'] = crew_df['crew'].apply(ast.literal_eval)

ids = list(crew_df['id'])
dfs = []

# Iterate over each movie and assign the corresponding foreign key to the entries
for movie_id, entries in zip(ids, crew_df['crew']):
    for entry in entries:
        entry['movie_id'] = movie_id

    # Convert data to DataFrame and append it to the list
    df = pd.DataFrame(entries)
    dfs.append(df)

# Concatenate all DataFrames into a single DataFrame
crew_dfs = pd.concat(dfs, ignore_index=True)
crew_dfs.to_csv('crew.csv', index = False)

C:\Users\sambo\AppData\Local\Temp\ipykernel_15088\2429640143.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  crew_df['crew'] = crew_df['crew'].apply(ast.literal_eval)

## Movies_Metadata.csv

### Genre Table

In [6]:
movies_metadata = pd.read_csv("movies_metadata.csv", low_memory=False)

In [7]:
movies_metadata = pd.read_csv("movies_metadata.csv", low_memory=False)
movies_metadata['genres'] = movies_metadata['genres'].apply(ast.literal_eval)
dfs = []
for movie_id, entries in zip(movies_metadata['id'], movies_metadata['genres']):
    for entry in entries:
        entry['movie_id'] = movie_id
    df = pd.DataFrame(entries)
    dfs.append(df)
genres_dfs = pd.concat(dfs, ignore_index=True)
genres_dfs.to_csv('movie_genres.csv', index=False)

### Production Companies Table

In [8]:
movies_metadata['production_companies'].fillna('[]', inplace=True)
movies_metadata['production_companies'] = movies_metadata['production_companies'].apply(ast.literal_eval)
dfs = []
for movie_id, entries in zip(movies_metadata['id'], movies_metadata['production_companies']):
    if isinstance(entries, list):
        for entry in entries:
            entry['movie_id'] = movie_id
        df = pd.DataFrame(entries)
        dfs.append(df)

prod_companies_dfs = pd.concat(dfs, ignore_index=True)
prod_companies_dfs.to_csv('Production_companies.csv', index=False)

### Spoken Languages Table

In [9]:
movies_metadata['spoken_languages'].fillna('[]', inplace=True)
movies_metadata['spoken_languages'] = movies_metadata['spoken_languages'].apply(ast.literal_eval)

spoken_languages_dfs = []

for movie_id, loop in zip(movies_metadata['id'], movies_metadata['spoken_languages']):
    # Iterate over each spoken language entry in the list
    for entry in loop:
        # Add 'movie_id' key to each entry
        entry['movie_id'] = movie_id
    # Convert the list of dictionaries to a DataFrame
    spoken_languages_df = pd.DataFrame(loop)
    # Append the DataFrame to the list of DataFrames
    spoken_languages_dfs.append(spoken_languages_df)

spoken_languages_dfs = pd.concat(spoken_languages_dfs, ignore_index=True)
spoken_languages_dfs.rename(columns={'name': 'language'}, inplace=True)
spoken_languages_dfs.to_csv('spoken_languages.csv', index=False)

### Collection Table

In [10]:
movies_metadata = pd.read_csv("movies_metadata.csv", low_memory=False)
movies_metadata['belongs_to_collection'].fillna('[{}]', inplace=True)
movies_metadata['belongs_to_collection'] = movies_metadata['belongs_to_collection'].apply(ast.literal_eval)

belongs_to_collection_dfs = []

# Iterate over each row of the DataFrame
for movie_id, collection in zip(movies_metadata['id'], movies_metadata['belongs_to_collection']):
    # Check if the collection is a dictionary
    if isinstance(collection, dict):
        # Add 'movie_id' key to the collection dictionary
        collection['movie_id'] = movie_id
        # Append the modified collection dictionary to the list
        belongs_to_collection_dfs.append(collection)
    elif isinstance(collection, list):
        # Iterate over each collection dictionary in the list
        for collection_dict in collection:
            # Add 'movie_id' key to the collection dictionary
            collection_dict['movie_id'] = movie_id
            # Append the modified collection dictionary to the list
            belongs_to_collection_dfs.append(collection_dict)

belongs_to_collection_df = pd.DataFrame(belongs_to_collection_dfs)
belongs_to_collection_df.dropna(subset=['name', 'poster_path', 'backdrop_path'], how='all', inplace=True)
belongs_to_collection_df['id'] = belongs_to_collection_df['id'].astype(int)
belongs_to_collection_df.to_csv('belongs_to_collection.csv', index=False)

## Ratings_small

In [11]:
ratings_small_df = pd.read_csv('ratings_small.csv')
ratings_small_df = pd.read_csv('ratings_small.csv')
ratings_small_df['timestamp'] = pd.to_datetime(ratings_small_df['timestamp'], unit='s')
ratings_small_df['timestamp'] = ratings_small_df['timestamp'].dt.strftime('%Y-%m-%d')
print(ratings_small_df['timestamp'].head(10))
ratings_small_df.to_csv('ratings_small_dateformat2_df.csv', index=False)

0    2009-12-14
1    2009-12-14
2    2009-12-14
3    2009-12-14
4    2009-12-14
5    2009-12-14
6    2009-12-14
7    2009-12-14
8    2009-12-14
9    2009-12-14
Name: timestamp, dtype: object

## Keywords

In [12]:
keywords_df = pd.read_csv('keywords.csv')
keywords_t = keywords_df["keywords"].apply(eval).apply(lambda x: [(d["id"], d["name"]) for d in x])
keywords_df.drop(columns=['keywords'], inplace=True)
keywords_df = pd.concat([keywords_df,keywords_t], axis =1)

df_unnested = keywords_df.explode('keywords')
df_unnested.dropna(subset=['keywords'], inplace=True)
#print(df_unnested[df_unnested['id'] == 45325])

df_unnested[['keyword_id', 'keyword_name']] = df_unnested['keywords'].apply(lambda x: pd.Series({'keyword_id': x[0], 'Keyword_name': x[1]}))
df_unnested.drop(columns=['keywords'], inplace=True)

#### View Tables

In [13]:
cast_dfs.head(3)

,cast_id,character,credit_id,gender,id,name,order,profile_path,movie_id
0,14,Woody (voice),52fe4284c3a36847f8024f95,2,31,Tom Hanks,0,/pQFoyx7rp09CJTAb932F2g8Nlho.jpg,862
1,15,Buzz Lightyear (voice),52fe4284c3a36847f8024f99,2,12898,Tim Allen,1,/uX2xVf6pMmPepxnvFWyBtjexzgY.jpg,862
2,16,Mr. Potato Head (voice),52fe4284c3a36847f8024f9d,2,7167,Don Rickles,2,/h5BcaDMPRVLHLDzbQavec4xfSdt.jpg,862

In [14]:
crew_dfs.head(3)

,credit_id,department,gender,id,job,name,profile_path,movie_id
0,52fe4284c3a36847f8024f49,Directing,2,7879,Director,John Lasseter,/7EdqiNbr4FRjIhKHyPPdFfEEEFG.jpg,862
1,52fe4284c3a36847f8024f4f,Writing,2,12891,Screenplay,Joss Whedon,/dTiVsuaTVTeGmvkhcyJvKp2A5kr.jpg,862
2,52fe4284c3a36847f8024f55,Writing,2,7,Screenplay,Andrew Stanton,/pvQWsu0qc8JFQhMVJkTHuexUAa1.jpg,862

In [15]:
genres_dfs.head(3)

      id       name movie_id
0     16  Animation      862
1     35     Comedy      862
2  10751     Family      862

In [16]:
prod_companies_dfs.head(3)

                      name    id movie_id
0  Pixar Animation Studios     3      862
1         TriStar Pictures   559     8844
2             Teitler Film  2550     8844

In [17]:
spoken_languages_dfs.head(3)

  iso_639_1  language movie_id
0        en   English      862
1        en   English     8844
2        fr  Français     8844

In [18]:
belongs_to_collection_df.head(3)

,id,name,poster_path,backdrop_path,movie_id
0,10194,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg,862
2,119050,Grumpy Old Men Collection,/nLvUdqgPgm3F85NMCii9gVFUcet.jpg,/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg,15602
4,96871,Father of the Bride Collection,/nts4iOmNnq7GNicycMJ9pSAn204.jpg,/7qwE57OVZmMJChBpLEbJEmzUydk.jpg,11862

In [19]:
ratings_small_df.head(5)

   userId  movieId  rating   timestamp
0       1       31     2.5  2009-12-14
1       1     1029     3.0  2009-12-14
2       1     1061     3.0  2009-12-14
3       1     1129     2.0  2009-12-14
4       1     1172     4.0  2009-12-14

In [20]:
df_unnested.head(15)

     id  keyword_id              keyword_name
0   862         931                  jealousy
0   862        4290                       toy
0   862        5202                       boy
0   862        6054                friendship
0   862        9713                   friends
0   862        9823                   rivalry
0   862      165503             boy next door
0   862      170722                   new toy
0   862      187065         toy comes to life
1  8844       10090                board game
1  8844       10941             disappearance
1  8844       15101  based on children's book
1  8844       33467                  new home
1  8844      158086                   recluse
1  8844      158091              giant insect